# 行政區 → 縣市
district_city_map = {

# 台北
"中正區":"臺北","大同區":"臺北","中山區":"臺北","松山區":"臺北",
"大安區":"臺北","萬華區":"臺北","信義區":"臺北","士林區":"臺北",
"北投區":"臺北","內湖區":"臺北","南港區":"臺北","文山區":"臺北",

# 新北
"板橋區":"新北","三重區":"新北","中和區":"新北","永和區":"新北",
"新莊區":"新北","新店區":"新北","土城區":"新北","蘆洲區":"新北",
"樹林區":"新北","汐止區":"新北","鶯歌區":"新北","三峽區":"新北",
"淡水區":"新北","瑞芳區":"新北","五股區":"新北","泰山區":"新北",
"林口區":"新北","深坑區":"新北","石碇區":"新北","坪林區":"新北",
"三芝區":"新北","石門區":"新北","八里區":"新北","平溪區":"新北",
"雙溪區":"新北","貢寮區":"新北","金山區":"新北","萬里區":"新北",
"烏來區":"新北",

# 桃園
"桃園區":"桃園","中壢區":"桃園","平鎮區":"桃園","八德區":"桃園",
"楊梅區":"桃園","蘆竹區":"桃園","大溪區":"桃園","龍潭區":"桃園",
"龜山區":"桃園","大園區":"桃園","觀音區":"桃園","新屋區":"桃園",
"復興區":"桃園",

# 台中
"西屯區":"臺中","北屯區":"臺中","南屯區":"臺中","太平區":"臺中",
"大里區":"臺中","烏日區":"臺中","霧峰區":"臺中","龍井區":"臺中",

# 台南
"永康區":"臺南","新營區":"臺南","善化區":"臺南","安南區":"臺南",
"安平區":"臺南","仁德區":"臺南",

# 高雄
"楠梓區":"高雄","左營區":"高雄","鼓山區":"高雄","三民區":"高雄",
"鹽埕區":"高雄","前金區":"高雄","新興區":"高雄","苓雅區":"高雄",
"前鎮區":"高雄","旗津區":"高雄","小港區":"高雄","鳳山區":"高雄",
"岡山區":"高雄","旗山區":"高雄","美濃區":"高雄",

# 宜蘭
"宜蘭市":"宜蘭","羅東鎮":"宜蘭","蘇澳鎮":"宜蘭","頭城鎮":"宜蘭",

# 屏東
"屏東市":"屏東","潮州鎮":"屏東","東港鎮":"屏東","恆春鎮":"屏東",

# 花蓮
"花蓮市":"花蓮","鳳林鎮":"花蓮","玉里鎮":"花蓮",

# 台東
"臺東市":"臺東","成功鎮":"臺東","關山鎮":"臺東"
}