# 所有可搜尋地區
districts = [

# 六都
"臺北市","新北市","桃園市","臺中市","臺南市","高雄市",

# 其他縣市
"基隆市","新竹市","嘉義市",
"新竹縣","苗栗縣","彰化縣","南投縣","雲林縣","嘉義縣",
"屏東縣","宜蘭縣","花蓮縣","臺東縣",
"澎湖縣","金門縣","連江縣",

# 台北
"中正區","大同區","中山區","松山區","大安區","萬華區",
"信義區","士林區","北投區","內湖區","南港區","文山區",

# 新北
"板橋區","三重區","中和區","永和區","新莊區","新店區",
"土城區","蘆洲區","樹林區","汐止區","鶯歌區","三峽區",
"淡水區","瑞芳區","五股區","泰山區","林口區",

# 桃園
"桃園區","中壢區","平鎮區","八德區","楊梅區","蘆竹區",

# 台中
"西屯區","北屯區","南屯區","太平區","大里區",

# 台南
"永康區","新營區","善化區",

# 高雄
"三民區","左營區","楠梓區","鳳山區","岡山區","旗山區","美濃區",

# 宜蘭
"宜蘭市","羅東鎮",

# 屏東
"屏東市","潮州鎮",

# 花蓮
"花蓮市",

# 台東
"臺東市"
]


# 行政區 → 縣市 mapping
district_city_map = {

# 台北
"中正區":"臺北","大同區":"臺北","中山區":"臺北","松山區":"臺北",
"大安區":"臺北","萬華區":"臺北","信義區":"臺北","士林區":"臺北",
"北投區":"臺北","內湖區":"臺北","南港區":"臺北","文山區":"臺北",

# 新北
"板橋區":"新北","三重區":"新北","中和區":"新北","永和區":"新北",
"新莊區":"新北","新店區":"新北","土城區":"新北","蘆洲區":"新北",
"樹林區":"新北","汐止區":"新北","鶯歌區":"新北","三峽區":"新北",
"淡水區":"新北","瑞芳區":"新北","五股區":"新北","泰山區":"新北",
"林口區":"新北",

# 桃園
"桃園區":"桃園","中壢區":"桃園","平鎮區":"桃園","八德區":"桃園",
"楊梅區":"桃園","蘆竹區":"桃園",

# 台中
"西屯區":"臺中","北屯區":"臺中","南屯區":"臺中",
"太平區":"臺中","大里區":"臺中",

# 台南
"永康區":"臺南","新營區":"臺南","善化區":"臺南",

# 高雄
"三民區":"高雄","左營區":"高雄","楠梓區":"高雄","鳳山區":"高雄",
"岡山區":"高雄","旗山區":"高雄","美濃區":"高雄",

# 宜蘭
"羅東鎮":"宜蘭","宜蘭市":"宜蘭",

# 屏東
"潮州鎮":"屏東","屏東市":"屏東",

# 花蓮
"花蓮市":"花蓮",

# 台東
"臺東市":"臺東"
}