# 全台縣市 + 行政區
districts = [

# 直轄市
"臺北市","新北市","桃園市","臺中市","臺南市","高雄市",

# 其他縣市
"基隆市","新竹市","嘉義市",
"新竹縣","苗栗縣","彰化縣","南投縣","雲林縣","嘉義縣",
"屏東縣","宜蘭縣","花蓮縣","臺東縣",
"澎湖縣","金門縣","連江縣",

# 台北
"中正區","大同區","中山區","松山區","大安區","萬華區",
"信義區","士林區","北投區","內湖區","南港區","文山區",

# 新北
"板橋區","三重區","中和區","永和區","新莊區","新店區",
"土城區","蘆洲區","樹林區","汐止區","鶯歌區","三峽區",
"淡水區","瑞芳區","五股區","泰山區","林口區","深坑區",
"石碇區","坪林區","三芝區","石門區","八里區","平溪區",
"雙溪區","貢寮區","金山區","萬里區","烏來區",

# 桃園
"桃園區","中壢區","平鎮區","八德區","楊梅區","蘆竹區",
"大溪區","龍潭區","龜山區","大園區","觀音區","新屋區","復興區",

# 台中
"中區","東區","南區","西區","北區",
"西屯區","南屯區","北屯區",
"豐原區","東勢區","大甲區","清水區","沙鹿區",
"梧棲區","后里區","神岡區","潭子區","大雅區",
"新社區","石岡區","外埔區","大安區","烏日區",
"大肚區","龍井區","霧峰區","太平區","大里區","和平區",

# 台南
"中西區","東區","南區","北區","安平區","安南區",
"永康區","歸仁區","新化區","玉井區","仁德區","關廟區",
"麻豆區","佳里區","新營區","鹽水區","善化區","新市區",

# 高雄
"楠梓區","左營區","鼓山區","三民區","鹽埕區",
"前金區","新興區","苓雅區","前鎮區","旗津區",
"小港區","鳳山區","岡山區","旗山區","美濃區",

# 宜蘭
"宜蘭市","羅東鎮","蘇澳鎮","頭城鎮",
"礁溪鄉","壯圍鄉","員山鄉","冬山鄉",
"五結鄉","三星鄉","大同鄉","南澳鄉",

# 屏東
"屏東市","潮州鎮","東港鎮","恆春鎮",
"萬丹鄉","長治鄉","內埔鄉","枋寮鄉",

# 花蓮
"花蓮市","鳳林鎮","玉里鎮",
"吉安鄉","壽豐鄉","瑞穗鄉",

# 台東
"臺東市","成功鎮","關山鎮",
"卑南鄉","鹿野鄉","池上鄉"
]


# 行政區 → 縣市
district_city_map = {

# 台北
"中正區":"臺北","大同區":"臺北","中山區":"臺北","松山區":"臺北",
"大安區":"臺北","萬華區":"臺北","信義區":"臺北","士林區":"臺北",
"北投區":"臺北","內湖區":"臺北","南港區":"臺北","文山區":"臺北",

# 新北
"板橋區":"新北","三重區":"新北","中和區":"新北","永和區":"新北",
"新莊區":"新北","新店區":"新北","土城區":"新北","蘆洲區":"新北",

# 桃園
"桃園區":"桃園","中壢區":"桃園","平鎮區":"桃園","八德區":"桃園",

# 台中
"西屯區":"臺中","北屯區":"臺中","南屯區":"臺中","太平區":"臺中","大里區":"臺中",

# 台南
"永康區":"臺南","新營區":"臺南","善化區":"臺南",

# 高雄
"三民區":"高雄","左營區":"高雄","楠梓區":"高雄","鳳山區":"高雄",
"岡山區":"高雄","旗山區":"高雄","美濃區":"高雄",

# 宜蘭
"羅東鎮":"宜蘭","宜蘭市":"宜蘭",

# 屏東
"潮州鎮":"屏東","屏東市":"屏東",

# 花蓮
"花蓮市":"花蓮",

# 台東
"臺東市":"臺東"
}